/*******************************文件信息***************************************
 **  文 件 名:    SysInfo.h
 **  版    本：   V1.0
 **  功    能：   
 **  用    法：
 **  作    者：   草塘
 **  日	   期：
 **----------------------------历史版本信息------------------------------------
 **  修 改 人：
 **  版    本： 
 **  日  　期：
 **  描  　述：
 ******************************************************************************/
#ifndef __SYS_INFO_H__
#define __SYS_INFO_H__

#include "config.h"





typedef struct   
{		

	
	
	u8 DebugEn;		
	
}stSysInfo;



extern stSysInfo SysInfo;



#endif






