


/**
  ******************************************************************************
  * @file    usb_desc.c
  * @author  MCD Application Team
  * @version V4.0.0
  * @date    21-January-2013
  * @brief   Descriptors for Keyboard HID Demo
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "usb_lib.h"
#include "usb_desc_ps4.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Extern variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/*============================================================================*/
/*============================================================================*/
/* USB Standard Device Descriptor USB标准设备描述符*/
/*============================================================================*/
/*============================================================================*/
const uint8_t Keyboard_DeviceDescriptor_ps4[KEYBOARD_SIZ_DEVICE_DESC_PS4] =
{
	0x12,                       /*bLength-------------------------------长度，设备描述符的长度为18字节*/
	USB_DEVICE_DESCRIPTOR_TYPE_PS4, /*bDescriptorType 0x01------------------类型，设备描述符编号是0x01*/
	0x00,                       /*bcdUSB--------------------------------使用的USB版本为2.0*/
	0x02,
	0x00,                       /*bDeviceClass--------------------------设备所使用的类代码*/
	0x00,                       /*bDeviceSubClass-----------------------设备所使用的子类代码*/
	0x00,                       /*bDeviceProtocol-----------------------设备所使用的协议*/
	0x40,                       /*bMaxPacketSize40----------------------端点0最大包长度，它的取值可以为8/16/32/64*/
/*------------VID-----------------------------------------------------------------------------------------*/
	0xc0,                       /*idVendor (0x0483)---------------------厂商ID为0x7788*/
	0x17,                       //该ID号由USB协会分配，不能随意使用。可以跟USB协会申请一个厂商ID号，
	                            //但是这是需要交“保护费”的。另外，主机通常是靠厂商ID号，产品ID以及
	                            //产品序列号来安装和加载驱动的，如果使用了别人的ID号，可能会导致驱动
	                            //程序安装或加载错误，从而导致设备无法工作。
/*------------PID-----------------------------------------------------------------------------------------*/	
	0xe1,                       /*idProduct = 0x5750--------------------产品ID为0x1122*/
	0x06,                       //与厂商ID号不一样，它是由生产厂商自己根据产品来编号的，比较自由。
	                            //通常主机会根据厂商ID、产品ID以及设备的序列号来加载对应的驱动。
	                            //有些朋友在修改描述符之后，重新做实验，却没有修改上面三个中的任何
	                            //一个，结果加载的还是旧驱动，从而工作不正常。如果没有想到这一点，
	                            //一个劲地在那查找固件的问题，恐怕是找不出问题的。如果不想修改这些
															//ID号和序列号，还有另外一个方法就是去设备管理器里，将原先的驱动卸载，
															//然后扫描新硬件或者拔下重新插上，让它重新安装驱动。不过有时卸载了
															//还是会有残留信息在注册表中，所以还是改ID比较保险。
/*-----------------------------------------------------------------------------------------------------*/
	
	0x00,                       /*bcdDevice rel. 1.00-------------------设备的版本号为1.00*/
	0x01,                       //当同一个产品升级后（例如修改了固件增加了某些功能），可以通过修改设备的
	                            //版本号来区别。
/*-----------------------------------------------------------------------------------------------------*/
	
	1,                          /*Index of string descriptor describing
																manufacturer--------------------------厂商字符串的索引*/
															//描述厂商的字符串的索引值。当该值为0时，表示没有厂商字符串。主机获取设备
															//描述符时，会将索引值放在wValue的第一字节中，用来选择不同的字符串。
/*-----------------------------------------------------------------------------------------------------*/																
	2,                          /*Index of string descriptor describing
																product-------------------------------产品字符串的索引*/
															//当该值为0时，表示没有产品字符串。当第一次插上某个USB设备时，会在
															//Windows的右下角弹出一个对话框，显示发现新硬件，并且会显示该设备的
															//名称。其实这里显示的信息就是从产品字符串里获取来的。如果想让它
															//显示出所需要的信息，应该修改产品字符串。
/*-----------------------------------------------------------------------------------------------------*/																		
	0,                          /*Index of string descriptor 
	                              describing thedevice serial number----设备序列号字符串索引*/
															//最好给你的每个产品指定一个唯一的序列号，好比每个英特尔的奔四处理器
															//都有一个ID号一样。设备序列号可能被主机联合VID和PID用来区别不同的设备，
															//有时同时连接多个具有相同VID/PID以及设备序列号的设备，可能会导致设备
															//无法正确识别。当该值为0时，表示没有序列号字符串。
															
															//(*****注意字符串索引值不要使用相同的值*****)//
/*-----------------------------------------------------------------------------------------------------*/																	
	0x01                        /*bNumConfigurations--------------------设备有1种配置*/
	                            //表示设备有多少种配置。每种配置都会有一个配置描述符，主机通过发送设置
															//配置来选择某一种配置。大部分的USB设备只有一个配置
/*-----------------------------------------------------------------------------------------------------*/	
}; /* Keyboard_DeviceDescriptor 设备描述符*/

/*============================================================================*/
/*============================================================================*/
/* USB Configuration Descriptor USB配置描述符集合（配置、接口、端点、类、厂商）*/  
/*   All Descriptors (Configuration, Interface, Endpoint, Class, Vendor */
/*============================================================================*/
/*============================================================================*/
const uint8_t Keyboard_ConfigDescriptor_ps4[KEYBOARD_SIZ_CONFIG_DESC_PS4] =
{

/*============================================================================*/	
/************** Configuration Descriptor (配置描述符) *************/
/*============================================================================*/ 	
	
	0x09, /* bLength: Configuration Descriptor size 长度，设备字符串的长度为9字节*/
	USB_CONFIGURATION_DESCRIPTOR_TYPE_PS4, /* bDescriptorType: Configuration  类型，配置描述符的类型编号为0x02*/
	KEYBOARD_SIZ_CONFIG_DESC_PS4, /*配置描述符的总长度为41字节*/
	/* wTotalLength: Bytes returned */
	0x00,
/*-------------------------------------------------------------------------------------------------------------------------------------*/			
	0x01,      /* bNumInterfaces: 1 interface---------------------------------配置所支持的接口数量1个*/
	                                                                          //表示该配置所支持的接口数量。通常，功能单一的
	                                                                          //设备只具有一个接口（例如鼠标），而复合设备则
	                                                                          //具有多个接口（例如音频设备）。
/*-------------------------------------------------------------------------------------------------------------------------------------*/			
	0x01,      /* bConfigurationValue: Configuration value--------------------该配置的值*/
	                                                                          //通常一个USB设备可以支持多个配置，bConfigurationValue
	                                                                          //就是每个配置的标识。设置配置请求时会发送一个配置值，
	                                                                          //如果某个配置的bConfigurationValue值与它相匹配，就
	                                                                          //表示该配置被激活，为当前配置。
/*-------------------------------------------------------------------------------------------------------------------------------------*/			
	0x00,      /* iConfiguration: Index of string 
	               descriptor describing the configuration--------------------该配置的字符串的索引值，该值为0表示没有字符串*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/			
	0x80,      /* bmAttributes: Self powered----------------------------------设备的一些特性，0xC0表示自供电，不支持远程唤醒
	                                                         -----------------D7：保留必须为1
	                                                         -----------------D6：供电方式。1：表示设备是自供电的  0：表示设备是总线供电的。
	                                                         -----------------D5：是否支持远程唤醒。1：支持远程唤醒
	                                                         -----------------D4-D0：保留设置为0*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/																															 
	0xfa,      /* MaxPower 100 mA: this current is used for detecting Vbus----设备需要从总线上获取多少电流，单位为2mA，0x96表示300mA*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/			                                                                          	
	
/*============================================================================*/	
/************** Descriptor of Keyboard HID interface (接口描述符) *************/
/*============================================================================*/ 	
	/* 09 */
	0x09,         /* bLength: Interface Descriptor size----------------------------长度，接口描述符的长度为9字节*/
	USB_INTERFACE_DESCRIPTOR_TYPE_PS4,/* bDescriptorType: Interface descriptor type----接口描述符的类型为0x04*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/			
	0x00,         /* bInterfaceNumber: Number of Interface-------------------------该接口的编号*/
	                                                                               //当一个配置具有多个接口时，每个接口的编号都不相同
																																								 //从0开始依次递增对一个配置的接口进行编号。
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x00,         /* bAlternateSetting: Alternate setting--------------------------该接口的备用编号*/
	                                                                               //编号规则与bInterfaceNumber一样，很少会使用该字段，设置为0
/*-------------------------------------------------------------------------------------------------------------------------------------*/	
	0x01,         /* bNumEndpoints-------------------------------------------------该接口所使用的端点数（不包括0端点）*/
	                                                                               //如果该字段为0，则表示没有非0端点，只使用默认的控制端点。
/*-------------------------------------------------------------------------------------------------------------------------------------*/																																								 
	0x03,         /* bInterfaceClass: HID------------------------------------------该接口所使用的类为HID*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/	
	0x00,         /* bInterfaceSubClass : 1=BOOT, 0=no boot------------------------该接口所用的子类 1=BOOT，0=NO BOOT*/
	                                                                               //在HID1.1协议中，只规定了一种子类：支持BIOS
																																								 //引导启动的子类，USB键盘、鼠标属于该子类，子类代码为0x01
/*-------------------------------------------------------------------------------------------------------------------------------------*/	
	0x00,         /* nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse--------------该接口使用的协议 0=NONE,1=Keyboard，2=Mouse*/
	                                                                               //如果子类为支持引导
/*-------------------------------------------------------------------------------------------------------------------------------------*/	
	0x00,         /* iInterface: Index of string descriptor------------------------该接口字符串的索引*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/	

/*============================================================================*/		
/******************** Descriptor of Keyboard HID HID (HID描述符) **************/
/*============================================================================*/	
	/* 18 */
	0x09,         /* bLength: HID Descriptor size----------------------------------HID描述符的长度为9字节*/
	                                                                               //它的大小与该描述符中下级描述符的个数有关。
/*-------------------------------------------------------------------------------------------------------------------------------------*/	
	HID_DESCRIPTOR_TYPE_PS4, /* bDescriptorType: HID-----------------------------------HID的描述符类型为0x21*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x11,         /* bcdHID: HID Class Spec release number-------------------------HID协议的版本为1.1*/
	0x01,
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x00,         /* bCountryCode: Hardware target country-------------------------国家代号*/
	                                                                               //通常我们的键盘是美式键盘，代码为33，即0x21
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x01,         /* bNumDescriptors: Number of HID class descriptors to follow----下级描述符的数量*/
	                                                                                //该值至少为1，即至少要有一个报告描述符。
																																									//下级描述符可以是报告描述符或物理描述符
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x22,         /* bDescriptorType-----------------------------------------------下级描述符的类型*/
	                                                                               //报告描述符的编号为0x22，物理描述符编号为0x23
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	KEYBOARD_SIZ_REPORT_DESC_PS4,/* bDescriptorLength: Total length of Report descriptor-----下一级描述符的长度*/
	0x00,	                                                                         //当有多个下级描述符时，bDescriptorType和bDescriptorLength
																																								 //交替重复下去
/*-------------------------------------------------------------------------------------------------------------------------------------*/		

/*============================================================================*/		
/************ Descriptor of Keyboard HID endpoints (输入端点描述符) ***********/
/*============================================================================*/	
	/* 27 */
	0x07,          /* bLength: Endpoint Descriptor size----------端点描述符的长度为7字节*/
	USB_ENDPOINT_DESCRIPTOR_TYPE_PS4, /* bDescriptorType:------------端点描述符的类型为0x05*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x81,          /* bEndpointAddress: Endpoint Address (IN)----该端点（输入）的地址，D7：0(OUT),1(IN),
	                                                                                   D6-D4：保留，设为0
																																										 D3-D0：端点号*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/																																											 
	0x03,          /* bmAttributes: Interrupt endpoint-----------端点的属性为中断端点
	                                                             D0-D1表示传输类型：0（控制传输），1（等时传输），2（批量传输），3（中断传输）
				                                                       非等时传输端点：D2-D7：保留为0
										                                           等时传输端点：D2-D3表示同步的类型：0（无同步），1（异步），2（适配），3（同步）
										                                                         D4-D5表示用途：0（数据端点），1（反馈端点），2（暗含反馈的数据端点），3（保留）
																	                                           D6-D7保留*/
/*-------------------------------------------------------------------------------------------------------------------------------------*/																																							 
	0x08,          /* wMaxPacketSize: 2 Bytes max----------------该端点支持的最大包长度为8字节*/     	
	0x00,                                                        //对于全速模式和低速模式，D10-D0表示端点的最大包长，其它位保留为0。对于
	                                                             //高速模式，D12-D11为每个帧附加的传输次数
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
	0x0a,          /* bInterval: Polling Interval (32 ms)--------轮询间隔*/
	                                                             //对于中断端点，表示查询的帧间隔数。
/*-------------------------------------------------------------------------------------------------------------------------------------*/		
//	/* 34 */

}; 

/*============================================================================*/
/*============================================================================*/
/* Keyboard_ConfigDescriptor 报告描述符*/
/* HID的报告描述符
USB HID设备是通过报告（report）来传送数据的，报告有输入报告和输出报告。
	输入报告是USB设备发送给主机的，例如：USB鼠标将鼠标移动和鼠标点击等信息返回给
计算机，键盘将按键数据返回给计算机等。
	输出报告是主机发送给USB设备的，例如：键盘上的数字键盘锁定灯和大写字母锁定灯
的控制等。
	报告里面包含的是所要传送的数据，数量为整数字节，被划分成一个个域。通常，输入
报告是通过中断输入端点返回的，而输出报告有点区别，当没有中断输出端点时，可以通过
控制输出端点0发送，当有中断输出端点时，通过中断输出端点发出。当然，不管设备是否
具有中断输出端点（中断输入端点是必须要的），主机都可以通过获取报告和设置报告的请求
从端点0来获取或者发送报告。
	而报告描述符（report descriptor），是用来描述一个报告的结构以及该报告里面的数据
是用来干什么用的。通过报告描述符，USB主机就可以分析报告里面的数据所表示的意义。
报告描述符与普通描述符一样，都是通过控制输入端点0来返回，主机使用获取报告描述符请求
来获取报告描述符，注意这个请求是发送到接口的，而不是到设备。一个报告描述符可以描述
多个报告，不同的报告通过报告ID来识别。报告ID放在报告的最前面，即第一个字节。当报告
描述符中没有规定报告ID时，报告中就没有ID字段，开始就是数据。
	那么报告描述符的结构是怎样的？又是怎样来定义这些报告数据的意义的呢？报告描述符与
前面所遇到的描述符结构不一样，它并没有描述符长度和描述符类型等信息，而是由一个个条目
（item）组成的。通常，在写报告描述符时，一个条目占据一行，这样看起来清晰一些。
	HID协议中规定了两种条目：短条目和厂条目。长条目很少使用。
	短条目由1字节的前缀后面跟上可选的数据字节组成。可选的数据字节可以为0字节、1字节、2
字节或者4字节。实际所使用的条目，大部分是只有1字节可选数据的，少数会使用0字节或
2字节数据。条目的前缀结构如下：
            bit   7 6 5 4     3 2      1 0
						       bTag      bType    bSize
	前缀的最低两位D1和D0为bSize，用来表示后面所跟数据的字节数，0为0字节，1为1字节，
2为2字节，3为4字节。D3和D2位为bType，表示条目的类型，0为主（main）条目，1为全局（global）
条目，2为局部（local）条目，3是保留值。bTag表示该条目的功能，具体参看HID协议以及
HID用途表。
	主条目总共有5个，分别为Input（输入）、Output（输出）、Feature（特性）、Collection（集合）
和End Collection（关集合）。主条目用来定义或者分组报告的数据域，例如，可以使用
输入主条目将输入报告划分为不同的数据域，以及指定该域的属性。对于Input，Output，Feature
三个主条目，后面跟的第一字节数据每个位的数据表示一种属性，例如：位0表示该数据域是变量
还是常量，位1表示是数组还是单一变量，位2表示是相对值还是绝对值等。
	全局条目主要用来选择用途页，定义数据域的长度、数量、报告ID等。全局条目在出现后对接下来
的所有主条目都有效，除非遇到另外一个全局条目来改变它。常用的全局条目有：Usage Page（用途页）、
Logical Minimum（逻辑最小值）、Logical Maximum（逻辑最大值）、Physical Minimum（物理最小值）、
Physical Maximum（物理最大值）、Report Size（数据域大小）、Report Count（数据域数量）和
Report ID（报告ID）。其中，Report Size用来描述某个数据域有多少个位，Report Count用来描述
这样的数据域有多少个；Logical Minimum和Logical Maximum用来描述数据域的取值范围。
	局部条目用来定义控制的特性，例如，该数据域的用途、用途最小值、用途最大值等。局部条目只在
局部有效，遇到一个主条目后，它的效用就结束了。常用的局部条目有：Usage（用途）、Usage Minimum
（用途最小值）和Usage Maximum（用途最大值）。
	
*/

/*============================================================================*/
/*============================================================================*/
/*定义了8字节发送：
**  第一字节表示特殊件是否按下：D0:Ctrl D1:Shift D2:Alt
**  第二字节保留，值为0
**  第三~第八字节:普通键键值的数组,最多能同时按下6个键

**定义了1字节接收:对应键盘上的LED灯,这里只用了两个位。
**	D0:Num Lock   D1:Cap Lock   D2:Scroll Lock   D3:Compose   D4:Kana*/
const uint8_t Keyboard_ReportDescriptor_ps4[KEYBOARD_SIZ_REPORT_DESC_PS4] =
{
/*=============================================================*/	
/*=============================================================*/	
	0x05,0x01,            // Usage Page (Generic Desktop) 选择用途页为普通桌面
	0x09,0x04,            // Usage (Joystick)
	0xa1,0x01,            // Collection (Application)开集合
	0x09,0x01,            // Usage (Pointer)
	0xa1,0x00,            // Collection (Physical) 
	0x85,0x01,            // Report (1)
	0x09,0x30,            // Usage (X)
	0x09,0x31,            // Usage (Y)
	0x15,0xff,            // Logcal_Minimum(255)
	0x25,0x01,            // Logcal_Maximum(1)
	0x75,0x02,            // Report_Size(2)
	0x95,0x02,            // Report_Count(2)
	0x81,0x02,            // Input (Data,Var,Abs)
	0x75,0x01,            // Report_Size(1)
	0x95,0x04,            // Report_Count(4) 
	0x81,0x03,            // Input(Cnst,Var,Abs)
	0x05,0x09,            // Usage Page (Button)
	0x19,0x01,            // Usage_Minimum(Button 1)
	0x29,0x0c,            // Usage Maximum(Button 12) 
	0x15,0x00,            // Logical_Minimum(0)
	0x25,0x01,            // Logical_Minimum(1)
	0x75,0x01,            // Report_Size(1)
	0x95,0x0c,            // Report_Count(12) 
	0x81,0x02,            // Input (Data,Var,Abs)
	0x75,0x01,            // Report_Size(1)	
	0x95,0x04,            // Report_Count(4) 
	0x81,0x03,            // Input(Cnst,Var,Abs)
	0xc0,                 // End_Collection
	0xc0,                 // End_Collection
/*=============================================================*/	
/*=============================================================*/		
	0x05,0x01,            // Usage Page (Generic Desktop) 选择用途页为普通桌面
	0x09,0x04,            // Usage (Joystick)
	0xa1,0x01,            // Collection (Application)开集合
	0x09,0x01,            // Usage (Pointer)
	0xa1,0x00,            // Collection (Physical)
	0x85,0x02,            // Report (2)
	0x09,0x30,            // Usage (X)	
	0x09,0x31,            // Usage (Y)
	0x15,0xff,            // Logcal_Minimum(255)
	0x25,0x01,            // Logcal_Maximum(1)
	0x75,0x02,            // Report_Size(2)
	0x95,0x02,            // Report_Count(2)
	0x81,0x02,            // Input (Data,Var,Abs)
	0x75,0x01,            // Report_Size(1)
	0x95,0x04,            // Report_Count(4)
	0x81,0x03,            // Input(Cnst,Var,Abs)
	0x05,0x09,            // Usage Page (Button)	
	0x19,0x01,            // Usage_Minimum(Button 1)
	0x29,0x0c,            // Usage Maximum(Button 12)
	0x15,0x00,            // Logcal_Minimum(0)
	0x25,0x01,            // Logcal_Maximum(1)
	0x75,0x01,            // Report_Size(1)
	0x95,0x0c,            // Report_Count(12)
	0x81,0x02,            // Input (Data,Var,Abs)
	0x75,0x01,            // Report_Size(1)
	0x95,0x04,            // Report_Count(4)
	0x81,0x03,            // Input(Cnst,Var,Abs)
	0xc0,                 // End_Collection
	0xc0                  // End_Collection
}; /* Keyboard_ReportDescriptor */

/*============================================================================*/
/*============================================================================*/
/* USB String Descriptors (optional) 语言ID描述符  */
/*============================================================================*/
/*============================================================================*/
const uint8_t Keyboard_StringLangID_ps4[KEYBOARD_SIZ_STRING_LANGID_PS4] =
{
    KEYBOARD_SIZ_STRING_LANGID_PS4,/*bLength：------------------本描述符的长度为4字节*/
    USB_STRING_DESCRIPTOR_TYPE_PS4,/*bDescriptorType：----------字符串描述符的类型为0x03*/
    0x09,/*bString：----------------------------------------语言ID为0x0409，表示美式英语*/
    0x04
}; /* LangID = 0x0409: U.S. English */
	
/*============================================================================*/
/*============================================================================*/	
/*厂商字符串描述符*/
/*============================================================================*/
/*============================================================================*/
const uint8_t Keyboard_StringVendor_ps4[KEYBOARD_SIZ_STRING_VENDOR_PS4] =
{
    KEYBOARD_SIZ_STRING_VENDOR_PS4, /* Size of Vendor string -------厂商字符串描述符的长度*/
    USB_STRING_DESCRIPTOR_TYPE_PS4,  /* bDescriptorType  -----------字符串描述符的类型为0x03*/
    /* Manufacturer: "STMicroelectronics" ----------------------自定义*/
    'P', 0, 'S', 0, '3', 0, '/', 0, 'P', 0, 'C', 0, ' ', 0,
    'G', 0, 'a', 0, 'm', 0, 'e', 0, 'p', 0, 'a', 0, 'd', 0	
};

/*============================================================================*/
/*============================================================================*/
/*产品的字符串描述符*/
/*============================================================================*/
/*============================================================================*/
const uint8_t Keyboard_StringProduct_ps4[KEYBOARD_SIZ_STRING_PRODUCT_PS4] =
{
	KEYBOARD_SIZ_STRING_PRODUCT_PS4,          /* bLength -----------------产品的字符串描述符*/
	USB_STRING_DESCRIPTOR_TYPE_PS4,        /* bDescriptorType ------------字符串描述符的类型为0x03*/
//    'S', 0, 'T', 0, 'M', 0, '3', 0, '2', 0, ' ', 0, 'J', 0,
//    'o', 0, 'y', 0, 's', 0, 't', 0, 'i', 0, 'c', 0, 'k', 0
	
    'P', 0, 'S', 0, '3', 0, '/', 0, 'P', 0, 'C', 0, ' ', 0,
    'G', 0, 'a', 0, 'm', 0, 'e', 0, 'p', 0, 'a', 0, 'd', 0	
};


/*============================================================================*/
/*============================================================================*/
/*产品序列号的字符串描述符*/
/*============================================================================*/
/*============================================================================*/
uint8_t Keyboard_StringSerial_ps4[KEYBOARD_SIZ_STRING_SERIAL_PS4] =
{
	KEYBOARD_SIZ_STRING_SERIAL_PS4,           /* bLength ----------------产品序列号*/
	USB_STRING_DESCRIPTOR_TYPE_PS4,        /* bDescriptorType -----------字符串描述符的类型为0x03*/
	'P', 0, 'S', 0, '3', 0,'/', 0,'P', 0 ,'S', 0/*--------------------------自定义*/
};

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

