/*******************************文件信息***************************************
 **  文 件 名:    Timer.h
 **  版    本：   V1.0
 **  功    能：   定时器
 **  用    法：
 **  作    者：   草塘
 **  日	   期：
 **----------------------------历史版本信息------------------------------------
 **  修 改 人：
 **  版    本： 
 **  日  　期：
 **  描  　述：
 ******************************************************************************/
#ifndef __STM32_TIMER_H__
#define __STM32_TIMER_H__

#include "config.h"


void STM32_TIM2_Config(void);  
void STM32_TIM3_Config(void); 

#endif


